Revit 2027 API
AssetPropertyFloatArray.GetValue Method
Get the value of the property.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<float> GetValue()
Public Function GetValue As IList(Of Single)
public:
IList<float>^ GetValue()
member GetValue : unit -> IList<float32>
Return Value
IList<Single>
See Also
Reference
AssetPropertyFloatArray Class
Autodesk.Revit.DB.Visual Namespace